#### RenderingQualitySettings Members

---

|  |
| --- |
| RenderingQualitySettings Class   Methods   Properties   See Also |

The  RenderingQualitySettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RenderingQualitySettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCustomQuality | Checks if the current rendering quality is custom or not. |
| Public method | IsValidRenderLevel | Validate the render level is between 1 and 40 |
| Public method | IsValidRenderTime | Validate the render time is between 1 and 32768. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LightAndMaterialAccuracyMode | A value that controls light and material accuracy mode. |
| Public property | RenderDuration | A value that controls render duration. |
| Public property | RenderingQuality | The quality applied for rendering. |
| Public property | RenderLevel | The render target level as a numerical value between 1 and 40. |
| Public property | RenderTime | The render target time as a numerical value between 1 and 32768. |

# See Also

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace